CASE 1
1
CASE 2
NO
CASE 3
NO
CASE 4
NO
CASE 5
NO
CASE 6
NO
CASE 7
NO
CASE 8
NO
CASE 9
NO
CASE 10
NO
CASE 11
5
CASE 12
NO
CASE 13
NO
CASE 14
14
CASE 15
NO
CASE 16
NO
CASE 17
NO
CASE 18
NO
CASE 19
NO
CASE 20
NO
CASE 21
1
CASE 22
NO
CASE 23
NO
CASE 24
NO
CASE 25
NO
CASE 26
NO
CASE 27
NO
CASE 28
NO
CASE 29
NO
CASE 30
8
CASE 31
1
CASE 32
NO
CASE 33
NO
CASE 34
NO
CASE 35
NO
CASE 36
NO
CASE 37
NO
CASE 38
NO
CASE 39
NO
CASE 40
NO
CASE 41
1
CASE 42
NO
CASE 43
NO
CASE 44
NO
CASE 45
4
CASE 46
NO
CASE 47
NO
CASE 48
NO
CASE 49
NO
CASE 50
NO
CASE 51
1
CASE 52
NO
CASE 53
NO
CASE 54
NO
CASE 55
NO
CASE 56
NO
CASE 57
NO
CASE 58
NO
CASE 59
20524
CASE 60
NO
CASE 61
39
CASE 62
NO
CASE 63
NO
CASE 64
NO
CASE 65
NO
CASE 66
NO
CASE 67
NO
CASE 68
NO
CASE 69
NO
CASE 70
NO
CASE 71
2
CASE 72
NO
CASE 73
NO
CASE 74
NO
CASE 75
NO
CASE 76
NO
CASE 77
NO
CASE 78
NO
CASE 79
NO
CASE 80
NO
CASE 81
19
CASE 82
NO
CASE 83
NO
CASE 84
NO
CASE 85
NO
CASE 86
NO
CASE 87
NO
CASE 88
NO
CASE 89
1
CASE 90
NO
CASE 91
1
CASE 92
NO
CASE 93
NO
CASE 94
NO
CASE 95
NO
CASE 96
NO
CASE 97
NO
CASE 98
NO
CASE 99
NO
CASE 100
NO
CASE 101
1
CASE 102
NO
CASE 103
NO
CASE 104
NO
CASE 105
NO
CASE 106
NO
CASE 107
NO
CASE 108
NO
CASE 109
NO
CASE 110
NO
CASE 111
127
CASE 112
NO
CASE 113
NO
CASE 114
NO
CASE 115
22
CASE 116
NO
CASE 117
NO
CASE 118
NO
CASE 119
NO
CASE 120
NO
CASE 121
10
CASE 122
NO
CASE 123
NO
CASE 124
NO
CASE 125
NO
CASE 126
NO
CASE 127
NO
CASE 128
NO
CASE 129
NO
CASE 130
NO
CASE 131
5
CASE 132
NO
CASE 133
NO
CASE 134
NO
CASE 135
NO
CASE 136
NO
CASE 137
NO
CASE 138
NO
CASE 139
NO
CASE 140
NO
CASE 141
84
CASE 142
NO
CASE 143
NO
CASE 144
NO
CASE 145
NO
CASE 146
NO
CASE 147
NO
CASE 148
NO
CASE 149
4
CASE 150
NO
CASE 151
1
CASE 152
NO
CASE 153
NO
CASE 154
NO
CASE 155
NO
CASE 156
NO
CASE 157
NO
CASE 158
NO
CASE 159
NO
CASE 160
NO
CASE 161
1
CASE 162
NO
CASE 163
NO
CASE 164
NO
CASE 165
NO
CASE 166
NO
CASE 167
NO
CASE 168
NO
CASE 169
NO
CASE 170
NO
CASE 171
68
CASE 172
NO
CASE 173
NO
CASE 174
NO
CASE 175
NO
CASE 176
NO
CASE 177
NO
CASE 178
NO
CASE 179
NO
CASE 180
NO
CASE 181
4
CASE 182
NO
CASE 183
NO
CASE 184
NO
CASE 185
NO
CASE 186
NO
CASE 187
NO
CASE 188
NO
CASE 189
NO
CASE 190
3
CASE 191
11
CASE 192
NO
CASE 193
NO
CASE 194
1
CASE 195
NO
CASE 196
NO
CASE 197
3
CASE 198
NO
CASE 199
NO
CASE 200
NO
CASE 201
1
CASE 202
NO
CASE 203
NO
CASE 204
11
CASE 205
NO
CASE 206
NO
CASE 207
NO
CASE 208
NO
CASE 209
NO
CASE 210
NO
CASE 211
4
CASE 212
NO
CASE 213
NO
CASE 214
NO
CASE 215
NO
CASE 216
NO
CASE 217
NO
CASE 218
NO
CASE 219
NO
CASE 220
NO
CASE 221
1
CASE 222
NO
CASE 223
NO
CASE 224
NO
CASE 225
NO
CASE 226
NO
CASE 227
12
CASE 228
NO
CASE 229
NO
CASE 230
NO
CASE 231
6
CASE 232
NO
CASE 233
NO
CASE 234
NO
CASE 235
NO
CASE 236
NO
CASE 237
NO
CASE 238
NO
CASE 239
NO
CASE 240
NO
CASE 241
2
CASE 242
NO
CASE 243
NO
CASE 244
NO
CASE 245
139
CASE 246
NO
CASE 247
NO
CASE 248
NO
CASE 249
NO
CASE 250
NO
CASE 251
2
CASE 252
NO
CASE 253
NO
CASE 254
NO
CASE 255
NO
CASE 256
NO
CASE 257
NO
CASE 258
NO
CASE 259
NO
CASE 260
NO
CASE 261
3
CASE 262
NO
CASE 263
NO
CASE 264
NO
CASE 265
NO
CASE 266
NO
CASE 267
NO
CASE 268
NO
CASE 269
NO
CASE 270
NO
CASE 271
1
CASE 272
NO
CASE 273
NO
CASE 274
NO
CASE 275
NO
CASE 276
424
CASE 277
NO
CASE 278
3
CASE 279
NO
CASE 280
NO
CASE 281
3
CASE 282
NO
CASE 283
NO
CASE 284
NO
CASE 285
NO
CASE 286
NO
CASE 287
NO
CASE 288
NO
CASE 289
NO
CASE 290
NO
CASE 291
1
CASE 292
NO
CASE 293
NO
CASE 294
NO
CASE 295
NO
CASE 296
NO
CASE 297
28
CASE 298
NO
CASE 299
NO
CASE 300
NO
CASE 301
4
CASE 302
NO
CASE 303
NO
CASE 304
NO
CASE 305
NO
CASE 306
NO
CASE 307
NO
CASE 308
NO
CASE 309
NO
CASE 310
NO
CASE 311
2
CASE 312
NO
CASE 313
NO
CASE 314
NO
CASE 315
NO
CASE 316
NO
CASE 317
NO
CASE 318
NO
CASE 319
NO
CASE 320
NO
CASE 321
1
CASE 322
NO
CASE 323
NO
CASE 324
NO
CASE 325
NO
CASE 326
NO
CASE 327
NO
CASE 328
NO
CASE 329
NO
CASE 330
NO
CASE 331
17
CASE 332
NO
CASE 333
NO
CASE 334
NO
CASE 335
NO
CASE 336
NO
CASE 337
NO
CASE 338
NO
CASE 339
NO
CASE 340
NO
CASE 341
9
CASE 342
NO
CASE 343
NO
CASE 344
NO
CASE 345
NO
CASE 346
NO
CASE 347
NO
CASE 348
NO
CASE 349
NO
CASE 350
NO
CASE 351
1
CASE 352
NO
CASE 353
NO
CASE 354
NO
CASE 355
NO
CASE 356
8
CASE 357
NO
CASE 358
NO
CASE 359
NO
CASE 360
NO
CASE 361
9
CASE 362
NO
CASE 363
NO
CASE 364
NO
CASE 365
NO
CASE 366
NO
CASE 367
NO
CASE 368
NO
CASE 369
NO
CASE 370
NO
CASE 371
3
CASE 372
NO
CASE 373
NO
CASE 374
NO
CASE 375
NO
CASE 376
NO
CASE 377
NO
CASE 378
NO
CASE 379
NO
CASE 380
NO
CASE 381
3
CASE 382
NO
CASE 383
NO
CASE 384
NO
CASE 385
NO
CASE 386
NO
CASE 387
NO
CASE 388
NO
CASE 389
NO
CASE 390
NO
CASE 391
1
CASE 392
NO
CASE 393
NO
CASE 394
NO
CASE 395
NO
CASE 396
NO
CASE 397
NO
CASE 398
NO
CASE 399
NO
CASE 400
12054
CASE 401
1
CASE 402
NO
CASE 403
NO
CASE 404
NO
CASE 405
NO
CASE 406
NO
CASE 407
NO
CASE 408
NO
CASE 409
NO
CASE 410
NO
CASE 411
2
CASE 412
NO
CASE 413
NO
CASE 414
NO
CASE 415
NO
CASE 416
NO
CASE 417
NO
CASE 418
NO
CASE 419
NO
CASE 420
NO
CASE 421
1
CASE 422
NO
CASE 423
NO
CASE 424
NO
CASE 425
NO
CASE 426
NO
CASE 427
NO
CASE 428
NO
CASE 429
NO
CASE 430
NO
CASE 431
38
CASE 432
NO
CASE 433
NO
CASE 434
NO
CASE 435
NO
CASE 436
NO
CASE 437
NO
CASE 438
NO
CASE 439
NO
CASE 440
NO
CASE 441
1
CASE 442
NO
CASE 443
NO
CASE 444
NO
CASE 445
NO
CASE 446
NO
CASE 447
NO
CASE 448
NO
CASE 449
NO
CASE 450
NO
CASE 451
13
CASE 452
NO
CASE 453
NO
CASE 454
NO
CASE 455
NO
CASE 456
NO
CASE 457
NO
CASE 458
1
CASE 459
NO
CASE 460
NO
CASE 461
1
CASE 462
NO
CASE 463
NO
CASE 464
NO
CASE 465
NO
CASE 466
NO
CASE 467
NO
CASE 468
NO
CASE 469
NO
CASE 470
NO
CASE 471
1
CASE 472
NO
CASE 473
NO
CASE 474
NO
CASE 475
NO
CASE 476
NO
CASE 477
NO
CASE 478
NO
CASE 479
NO
CASE 480
NO
CASE 481
1
CASE 482
NO
CASE 483
NO
CASE 484
NO
CASE 485
NO
CASE 486
NO
CASE 487
NO
CASE 488
NO
CASE 489
NO
CASE 490
NO
CASE 491
9
CASE 492
NO
CASE 493
NO
CASE 494
NO
CASE 495
NO
CASE 496
NO
CASE 497
NO
CASE 498
NO
CASE 499
NO
CASE 500
3
CASE 501
2
CASE 502
NO
CASE 503
NO
CASE 504
NO
CASE 505
NO
CASE 506
NO
CASE 507
NO
CASE 508
NO
CASE 509
NO
CASE 510
NO
CASE 511
1
CASE 512
NO
CASE 513
NO
CASE 514
NO
CASE 515
5
CASE 516
NO
CASE 517
NO
CASE 518
4
CASE 519
NO
CASE 520
NO
CASE 521
4
CASE 522
NO
CASE 523
NO
CASE 524
NO
CASE 525
NO
CASE 526
NO
CASE 527
NO
CASE 528
NO
CASE 529
NO
CASE 530
NO
CASE 531
1
CASE 532
NO
CASE 533
NO
CASE 534
NO
CASE 535
NO
CASE 536
NO
CASE 537
NO
CASE 538
NO
CASE 539
NO
CASE 540
NO
CASE 541
1
CASE 542
NO
CASE 543
NO
CASE 544
NO
CASE 545
NO
CASE 546
NO
CASE 547
NO
CASE 548
NO
CASE 549
NO
CASE 550
NO
CASE 551
12
CASE 552
NO
CASE 553
NO
CASE 554
NO
CASE 555
NO
CASE 556
NO
CASE 557
NO
CASE 558
NO
CASE 559
NO
CASE 560
NO
CASE 561
2
CASE 562
NO
CASE 563
NO
CASE 564
NO
CASE 565
NO
CASE 566
NO
CASE 567
NO
CASE 568
NO
CASE 569
NO
CASE 570
NO
CASE 571
16
CASE 572
NO
CASE 573
NO
CASE 574
NO
CASE 575
NO
CASE 576
NO
CASE 577
NO
CASE 578
NO
CASE 579
NO
CASE 580
NO
CASE 581
7
CASE 582
NO
CASE 583
NO
CASE 584
NO
CASE 585
NO
CASE 586
NO
CASE 587
NO
CASE 588
NO
CASE 589
NO
CASE 590
NO
CASE 591
14
CASE 592
NO
CASE 593
NO
CASE 594
NO
CASE 595
NO
CASE 596
NO
CASE 597
NO
CASE 598
NO
CASE 599
NO
CASE 600
NO
CASE 601
3
CASE 602
NO
CASE 603
NO
CASE 604
NO
CASE 605
NO
CASE 606
NO
CASE 607
NO
CASE 608
NO
CASE 609
NO
CASE 610
NO
CASE 611
1
CASE 612
NO
CASE 613
NO
CASE 614
NO
CASE 615
NO
CASE 616
NO
CASE 617
NO
CASE 618
NO
CASE 619
NO
CASE 620
NO
CASE 621
1
CASE 622
NO
CASE 623
NO
CASE 624
NO
CASE 625
NO
CASE 626
NO
CASE 627
NO
CASE 628
NO
CASE 629
NO
CASE 630
NO
CASE 631
1
CASE 632
NO
CASE 633
NO
CASE 634
NO
CASE 635
NO
CASE 636
NO
CASE 637
NO
CASE 638
NO
CASE 639
NO
CASE 640
NO
CASE 641
4
CASE 642
NO
CASE 643
NO
CASE 644
NO
CASE 645
NO
CASE 646
NO
CASE 647
NO
CASE 648
1
CASE 649
NO
CASE 650
NO
CASE 651
1
CASE 652
573
CASE 653
NO
CASE 654
NO
CASE 655
NO
CASE 656
NO
CASE 657
NO
CASE 658
NO
CASE 659
NO
CASE 660
NO
CASE 661
2
CASE 662
NO
CASE 663
NO
CASE 664
NO
CASE 665
NO
CASE 666
NO
CASE 667
NO
CASE 668
NO
CASE 669
NO
CASE 670
NO
CASE 671
1
CASE 672
NO
CASE 673
NO
CASE 674
NO
CASE 675
NO
CASE 676
NO
CASE 677
NO
CASE 678
NO
CASE 679
NO
CASE 680
NO
CASE 681
1
CASE 682
NO
CASE 683
NO
CASE 684
NO
CASE 685
NO
CASE 686
NO
CASE 687
NO
CASE 688
NO
CASE 689
NO
CASE 690
NO
CASE 691
1
CASE 692
NO
CASE 693
NO
CASE 694
NO
CASE 695
NO
CASE 696
NO
CASE 697
NO
CASE 698
NO
CASE 699
NO
CASE 700
NO
CASE 701
7
CASE 702
NO
CASE 703
NO
CASE 704
NO
CASE 705
NO
CASE 706
NO
CASE 707
NO
CASE 708
NO
CASE 709
NO
CASE 710
NO
CASE 711
1
CASE 712
NO
CASE 713
NO
CASE 714
NO
CASE 715
NO
CASE 716
NO
CASE 717
NO
CASE 718
NO
CASE 719
NO
CASE 720
NO
CASE 721
2
CASE 722
NO
CASE 723
NO
CASE 724
NO
CASE 725
NO
CASE 726
NO
CASE 727
NO
CASE 728
NO
CASE 729
NO
CASE 730
NO
CASE 731
1
CASE 732
NO
CASE 733
NO
CASE 734
NO
CASE 735
NO
CASE 736
NO
CASE 737
NO
CASE 738
NO
CASE 739
NO
CASE 740
NO
CASE 741
2
CASE 742
NO
CASE 743
NO
CASE 744
NO
CASE 745
NO
CASE 746
NO
CASE 747
NO
CASE 748
NO
CASE 749
NO
CASE 750
NO
CASE 751
3
CASE 752
NO
CASE 753
NO
CASE 754
NO
CASE 755
NO
CASE 756
NO
CASE 757
NO
CASE 758
NO
CASE 759
NO
CASE 760
NO
CASE 761
2
CASE 762
NO
CASE 763
NO
CASE 764
NO
CASE 765
NO
CASE 766
NO
CASE 767
NO
CASE 768
NO
CASE 769
NO
CASE 770
NO
CASE 771
9
CASE 772
NO
CASE 773
NO
CASE 774
NO
CASE 775
NO
CASE 776
NO
CASE 777
NO
CASE 778
NO
CASE 779
NO
CASE 780
NO
CASE 781
5
CASE 782
NO
CASE 783
NO
CASE 784
NO
CASE 785
NO
CASE 786
NO
CASE 787
NO
CASE 788
NO
CASE 789
NO
CASE 790
NO
CASE 791
1
CASE 792
NO
CASE 793
NO
CASE 794
NO
CASE 795
NO
CASE 796
NO
CASE 797
NO
CASE 798
NO
CASE 799
NO
CASE 800
NO
CASE 801
1
CASE 802
NO
CASE 803
NO
CASE 804
NO
CASE 805
NO
CASE 806
NO
CASE 807
NO
CASE 808
NO
CASE 809
NO
CASE 810
NO
CASE 811
1
CASE 812
NO
CASE 813
NO
CASE 814
NO
CASE 815
NO
CASE 816
NO
CASE 817
NO
CASE 818
NO
CASE 819
NO
CASE 820
NO
CASE 821
1
CASE 822
NO
CASE 823
NO
CASE 824
NO
CASE 825
NO
CASE 826
NO
CASE 827
NO
CASE 828
NO
CASE 829
NO
CASE 830
NO
CASE 831
5
CASE 832
NO
CASE 833
NO
CASE 834
NO
CASE 835
NO
CASE 836
NO
CASE 837
NO
CASE 838
NO
CASE 839
NO
CASE 840
NO
CASE 841
14
CASE 842
NO
CASE 843
NO
CASE 844
NO
CASE 845
NO
CASE 846
NO
CASE 847
NO
CASE 848
NO
CASE 849
NO
CASE 850
NO
CASE 851
1
CASE 852
NO
CASE 853
NO
CASE 854
NO
CASE 855
NO
CASE 856
NO
CASE 857
NO
CASE 858
NO
CASE 859
NO
CASE 860
NO
CASE 861
1
CASE 862
NO
CASE 863
NO
CASE 864
NO
CASE 865
NO
CASE 866
NO
CASE 867
NO
CASE 868
NO
CASE 869
NO
CASE 870
NO
CASE 871
4
CASE 872
NO
CASE 873
NO
CASE 874
NO
CASE 875
NO
CASE 876
NO
CASE 877
NO
CASE 878
NO
CASE 879
NO
CASE 880
NO
CASE 881
1
CASE 882
NO
CASE 883
NO
CASE 884
NO
CASE 885
NO
CASE 886
2
CASE 887
NO
CASE 888
NO
CASE 889
NO
CASE 890
NO
CASE 891
2
CASE 892
NO
CASE 893
NO
CASE 894
NO
CASE 895
NO
CASE 896
NO
CASE 897
NO
CASE 898
NO
CASE 899
NO
CASE 900
NO
CASE 901
2
CASE 902
NO
CASE 903
NO
CASE 904
NO
CASE 905
NO
CASE 906
NO
CASE 907
NO
CASE 908
NO
CASE 909
NO
CASE 910
NO
CASE 911
1
CASE 912
NO
CASE 913
NO
CASE 914
NO
CASE 915
NO
CASE 916
NO
CASE 917
NO
CASE 918
NO
CASE 919
NO
CASE 920
NO
CASE 921
3
CASE 922
NO
CASE 923
NO
CASE 924
NO
CASE 925
NO
CASE 926
NO
CASE 927
NO
CASE 928
NO
CASE 929
NO
CASE 930
NO
CASE 931
31
CASE 932
NO
CASE 933
NO
CASE 934
NO
CASE 935
NO
CASE 936
NO
CASE 937
NO
CASE 938
NO
CASE 939
NO
CASE 940
NO
CASE 941
1
CASE 942
NO
CASE 943
NO
CASE 944
NO
CASE 945
1
CASE 946
NO
CASE 947
NO
CASE 948
NO
CASE 949
NO
CASE 950
NO
CASE 951
13
CASE 952
NO
CASE 953
NO
CASE 954
NO
CASE 955
NO
CASE 956
NO
CASE 957
NO
CASE 958
NO
CASE 959
NO
CASE 960
9
CASE 961
2
CASE 962
NO
CASE 963
NO
CASE 964
NO
CASE 965
NO
CASE 966
NO
CASE 967
NO
CASE 968
NO
CASE 969
NO
CASE 970
NO
CASE 971
1
CASE 972
NO
CASE 973
NO
CASE 974
NO
CASE 975
NO
CASE 976
NO
CASE 977
NO
CASE 978
NO
CASE 979
NO
CASE 980
NO
CASE 981
1
CASE 982
NO
CASE 983
NO
CASE 984
NO
CASE 985
NO
CASE 986
NO
CASE 987
NO
CASE 988
NO
CASE 989
NO
CASE 990
NO
CASE 991
27
CASE 992
NO
CASE 993
NO
CASE 994
NO
CASE 995
NO
CASE 996
NO
CASE 997
NO
CASE 998
NO
CASE 999
NO
CASE 1000
NO
CASE 1001
1
CASE 1002
NO
CASE 1003
NO
CASE 1004
NO
CASE 1005
NO
CASE 1006
NO
CASE 1007
NO
CASE 1008
NO
CASE 1009
NO
CASE 1010
NO
CASE 1011
4
CASE 1012
NO
CASE 1013
NO
CASE 1014
NO
CASE 1015
NO
CASE 1016
NO
CASE 1017
NO
CASE 1018
NO
CASE 1019
NO
CASE 1020
NO
CASE 1021
2
CASE 1022
NO
CASE 1023
NO
CASE 1024
NO
CASE 1025
NO
CASE 1026
NO
CASE 1027
NO
CASE 1028
NO
CASE 1029
NO
CASE 1030
NO
CASE 1031
1
CASE 1032
NO
CASE 1033
NO
CASE 1034
NO
CASE 1035
NO
CASE 1036
NO
CASE 1037
NO
CASE 1038
NO
CASE 1039
NO
CASE 1040
NO
CASE 1041
1
CASE 1042
NO
CASE 1043
NO
CASE 1044
NO
CASE 1045
NO
CASE 1046
NO
CASE 1047
NO
CASE 1048
NO
CASE 1049
NO
CASE 1050
NO
CASE 1051
34
CASE 1052
NO
CASE 1053
NO
CASE 1054
NO
CASE 1055
NO
CASE 1056
NO
CASE 1057
NO
CASE 1058
NO
CASE 1059
NO
CASE 1060
NO
CASE 1061
31
CASE 1062
NO
CASE 1063
NO
CASE 1064
NO
CASE 1065
NO
CASE 1066
NO
CASE 1067
NO
CASE 1068
NO
CASE 1069
NO
CASE 1070
NO
CASE 1071
2
CASE 1072
25
CASE 1073
NO
CASE 1074
NO
CASE 1075
NO
CASE 1076
NO
CASE 1077
NO
CASE 1078
NO
CASE 1079
NO
CASE 1080
NO
CASE 1081
4
CASE 1082
NO
CASE 1083
NO
CASE 1084
NO
CASE 1085
NO
CASE 1086
NO
CASE 1087
NO
CASE 1088
NO
CASE 1089
NO
CASE 1090
NO
CASE 1091
5
CASE 1092
NO
CASE 1093
NO
CASE 1094
NO
CASE 1095
8
CASE 1096
NO
CASE 1097
NO
CASE 1098
NO
CASE 1099
NO
CASE 1100
NO
CASE 1101
5
CASE 1102
NO
CASE 1103
NO
CASE 1104
NO
CASE 1105
NO
CASE 1106
NO
CASE 1107
NO
CASE 1108
NO
CASE 1109
NO
CASE 1110
NO
CASE 1111
4
CASE 1112
NO
CASE 1113
NO
CASE 1114
NO
CASE 1115
NO
CASE 1116
NO
CASE 1117
NO
CASE 1118
NO
CASE 1119
NO
CASE 1120
58
CASE 1121
1
CASE 1122
NO
CASE 1123
NO
CASE 1124
NO
CASE 1125
NO
CASE 1126
NO
CASE 1127
NO
CASE 1128
NO
CASE 1129
NO
CASE 1130
NO
CASE 1131
3
CASE 1132
NO
CASE 1133
NO
CASE 1134
NO
CASE 1135
NO
CASE 1136
NO
CASE 1137
NO
CASE 1138
NO
CASE 1139
NO
CASE 1140
NO
CASE 1141
1
CASE 1142
NO
CASE 1143
NO
CASE 1144
NO
CASE 1145
NO
CASE 1146
NO
CASE 1147
NO
CASE 1148
NO
CASE 1149
NO
CASE 1150
NO
CASE 1151
1
CASE 1152
NO
CASE 1153
NO
CASE 1154
NO
CASE 1155
NO
CASE 1156
NO
CASE 1157
NO
CASE 1158
NO
CASE 1159
NO
CASE 1160
1
CASE 1161
4
CASE 1162
NO
CASE 1163
NO
CASE 1164
NO
CASE 1165
NO
CASE 1166
NO
CASE 1167
NO
CASE 1168
NO
CASE 1169
NO
CASE 1170
NO
CASE 1171
1
CASE 1172
NO
CASE 1173
NO
CASE 1174
NO
CASE 1175
NO
CASE 1176
NO
CASE 1177
NO
CASE 1178
NO
CASE 1179
NO
CASE 1180
NO
CASE 1181
10
CASE 1182
NO
CASE 1183
NO
CASE 1184
NO
CASE 1185
NO
CASE 1186
NO
CASE 1187
NO
CASE 1188
NO
CASE 1189
NO
CASE 1190
NO
CASE 1191
7
CASE 1192
NO
CASE 1193
NO
CASE 1194
NO
CASE 1195
NO
CASE 1196
NO
CASE 1197
NO
CASE 1198
NO
CASE 1199
NO
CASE 1200
NO
CASE 1201
1
CASE 1202
NO
CASE 1203
NO
CASE 1204
NO
CASE 1205
NO
CASE 1206
NO
CASE 1207
NO
CASE 1208
NO
CASE 1209
NO
CASE 1210
NO
CASE 1211
1
CASE 1212
NO
CASE 1213
NO
CASE 1214
NO
CASE 1215
NO
CASE 1216
NO
CASE 1217
NO
CASE 1218
NO
CASE 1219
NO
CASE 1220
NO
CASE 1221
1
CASE 1222
NO
CASE 1223
NO
CASE 1224
NO
CASE 1225
NO
CASE 1226
NO
CASE 1227
92
CASE 1228
NO
CASE 1229
NO
CASE 1230
NO
CASE 1231
6
CASE 1232
NO
CASE 1233
NO
CASE 1234
NO
CASE 1235
NO
CASE 1236
NO
CASE 1237
NO
CASE 1238
NO
CASE 1239
NO
CASE 1240
NO
CASE 1241
13
CASE 1242
NO
CASE 1243
NO
CASE 1244
NO
CASE 1245
NO
CASE 1246
NO
CASE 1247
NO
CASE 1248
NO
CASE 1249
NO
CASE 1250
NO
CASE 1251
1
CASE 1252
NO
CASE 1253
NO
CASE 1254
NO
CASE 1255
NO
CASE 1256
NO
CASE 1257
NO
CASE 1258
NO
CASE 1259
NO
CASE 1260
NO
CASE 1261
12
CASE 1262
NO
CASE 1263
NO
CASE 1264
NO
CASE 1265
NO
CASE 1266
NO
CASE 1267
NO
CASE 1268
NO
CASE 1269
NO
CASE 1270
NO
CASE 1271
1
CASE 1272
NO
CASE 1273
NO
CASE 1274
NO
CASE 1275
NO
CASE 1276
NO
CASE 1277
NO
CASE 1278
NO
CASE 1279
NO
CASE 1280
NO
CASE 1281
1
CASE 1282
NO
CASE 1283
NO
CASE 1284
NO
CASE 1285
NO
CASE 1286
NO
CASE 1287
NO
CASE 1288
NO
CASE 1289
NO
CASE 1290
NO
CASE 1291
78
CASE 1292
NO
CASE 1293
NO
CASE 1294
NO
CASE 1295
NO
CASE 1296
NO
CASE 1297
NO
CASE 1298
NO
CASE 1299
NO
CASE 1300
NO
CASE 1301
1
CASE 1302
NO
CASE 1303
NO
CASE 1304
NO
CASE 1305
NO
CASE 1306
NO
CASE 1307
NO
CASE 1308
NO
CASE 1309
NO
CASE 1310
NO
CASE 1311
1
CASE 1312
NO
CASE 1313
NO
CASE 1314
NO
CASE 1315
NO
CASE 1316
NO
CASE 1317
NO
CASE 1318
NO
CASE 1319
NO
CASE 1320
NO
CASE 1321
1
CASE 1322
NO
CASE 1323
NO
CASE 1324
NO
CASE 1325
NO
CASE 1326
NO
CASE 1327
NO
CASE 1328
NO
CASE 1329
NO
CASE 1330
NO
CASE 1331
55
CASE 1332
NO
CASE 1333
NO
CASE 1334
NO
CASE 1335
NO
CASE 1336
NO
CASE 1337
NO
CASE 1338
NO
CASE 1339
NO
CASE 1340
NO
CASE 1341
1
CASE 1342
NO
CASE 1343
NO
CASE 1344
NO
CASE 1345
6
CASE 1346
NO
CASE 1347
NO
CASE 1348
NO
CASE 1349
NO
CASE 1350
NO
CASE 1351
9
CASE 1352
NO
CASE 1353
NO
CASE 1354
NO
CASE 1355
NO
CASE 1356
NO
CASE 1357
NO
CASE 1358
NO
CASE 1359
NO
CASE 1360
NO
CASE 1361
14
CASE 1362
NO
CASE 1363
NO
CASE 1364
NO
CASE 1365
NO
CASE 1366
NO
CASE 1367
NO
CASE 1368
NO
CASE 1369
NO
CASE 1370
NO
CASE 1371
6
CASE 1372
NO
CASE 1373
NO
CASE 1374
NO
CASE 1375
NO
CASE 1376
NO
CASE 1377
NO
CASE 1378
NO
CASE 1379
NO
CASE 1380
NO
CASE 1381
9
CASE 1382
NO
CASE 1383
2
CASE 1384
NO
CASE 1385
NO
CASE 1386
NO
CASE 1387
NO
CASE 1388
NO
CASE 1389
NO
CASE 1390
NO
CASE 1391
2
CASE 1392
NO
CASE 1393
NO
CASE 1394
NO
CASE 1395
NO
CASE 1396
NO
CASE 1397
NO
CASE 1398
NO
CASE 1399
NO
CASE 1400
NO
CASE 1401
1
CASE 1402
NO
CASE 1403
NO
CASE 1404
NO
CASE 1405
NO
CASE 1406
NO
CASE 1407
NO
CASE 1408
NO
CASE 1409
NO
CASE 1410
NO
CASE 1411
1
CASE 1412
NO
CASE 1413
1
CASE 1414
NO
CASE 1415
NO
CASE 1416
NO
CASE 1417
NO
CASE 1418
NO
CASE 1419
NO
CASE 1420
NO
CASE 1421
2
CASE 1422
NO
CASE 1423
NO
CASE 1424
NO
CASE 1425
NO
CASE 1426
NO
CASE 1427
NO
CASE 1428
NO
CASE 1429
NO
CASE 1430
NO
CASE 1431
1
CASE 1432
NO
CASE 1433
NO
CASE 1434
NO
CASE 1435
NO
CASE 1436
NO
CASE 1437
NO
CASE 1438
NO
CASE 1439
NO
CASE 1440
NO
CASE 1441
3
CASE 1442
NO
CASE 1443
NO
CASE 1444
NO
CASE 1445
NO
CASE 1446
NO
CASE 1447
NO
CASE 1448
NO
CASE 1449
NO
CASE 1450
NO
CASE 1451
2
CASE 1452
NO
CASE 1453
NO
CASE 1454
NO
CASE 1455
NO
CASE 1456
NO
CASE 1457
NO
CASE 1458
NO
CASE 1459
NO
CASE 1460
NO
CASE 1461
2
CASE 1462
NO
CASE 1463
NO
CASE 1464
NO
CASE 1465
NO
CASE 1466
NO
CASE 1467
NO
CASE 1468
NO
CASE 1469
NO
CASE 1470
NO
CASE 1471
28
CASE 1472
NO
CASE 1473
NO
CASE 1474
NO
CASE 1475
NO
CASE 1476
NO
CASE 1477
NO
CASE 1478
NO
CASE 1479
NO
CASE 1480
NO
CASE 1481
2
CASE 1482
NO
CASE 1483
NO
CASE 1484
NO
CASE 1485
NO
CASE 1486
NO
CASE 1487
NO
CASE 1488
NO
CASE 1489
NO
CASE 1490
NO
CASE 1491
1
CASE 1492
NO
CASE 1493
NO
CASE 1494
NO
CASE 1495
NO
CASE 1496
NO
CASE 1497
NO
CASE 1498
NO
CASE 1499
NO
CASE 1500
NO
CASE 1501
1
CASE 1502
NO
CASE 1503
NO
CASE 1504
NO
CASE 1505
NO
CASE 1506
NO
CASE 1507
NO
CASE 1508
NO
CASE 1509
NO
CASE 1510
NO
CASE 1511
4
CASE 1512
NO
CASE 1513
NO
CASE 1514
NO
CASE 1515
NO
CASE 1516
NO
CASE 1517
NO
CASE 1518
NO
CASE 1519
NO
CASE 1520
NO
CASE 1521
4
CASE 1522
NO
CASE 1523
NO
CASE 1524
NO
CASE 1525
NO
CASE 1526
NO
CASE 1527
NO
CASE 1528
NO
CASE 1529
NO
CASE 1530
NO
CASE 1531
4
CASE 1532
NO
CASE 1533
NO
CASE 1534
NO
CASE 1535
NO
CASE 1536
NO
CASE 1537
NO
CASE 1538
NO
CASE 1539
NO
CASE 1540
NO
CASE 1541
1
CASE 1542
NO
CASE 1543
NO
CASE 1544
NO
CASE 1545
NO
CASE 1546
NO
CASE 1547
NO
CASE 1548
NO
CASE 1549
NO
CASE 1550
NO
CASE 1551
8
CASE 1552
NO
CASE 1553
NO
CASE 1554
NO
CASE 1555
NO
CASE 1556
NO
CASE 1557
NO
CASE 1558
NO
CASE 1559
NO
CASE 1560
NO
CASE 1561
22
CASE 1562
NO
CASE 1563
NO
CASE 1564
NO
CASE 1565
NO
CASE 1566
NO
CASE 1567
NO
CASE 1568
NO
CASE 1569
NO
CASE 1570
NO
CASE 1571
27
CASE 1572
NO
CASE 1573
NO
CASE 1574
NO
CASE 1575
NO
CASE 1576
NO
CASE 1577
NO
CASE 1578
NO
CASE 1579
NO
CASE 1580
NO
CASE 1581
15
CASE 1582
NO
CASE 1583
NO
CASE 1584
NO
CASE 1585
NO
CASE 1586
NO
CASE 1587
NO
CASE 1588
NO
CASE 1589
NO
CASE 1590
NO
CASE 1591
13
CASE 1592
NO
CASE 1593
NO
CASE 1594
NO
CASE 1595
NO
CASE 1596
NO
CASE 1597
NO
CASE 1598
NO
CASE 1599
NO
CASE 1600
NO
CASE 1601
1
CASE 1602
NO
CASE 1603
NO
CASE 1604
1
CASE 1605
NO
CASE 1606
NO
CASE 1607
NO
CASE 1608
NO
CASE 1609
NO
CASE 1610
NO
CASE 1611
15
CASE 1612
NO
CASE 1613
NO
CASE 1614
NO
CASE 1615
NO
CASE 1616
NO
CASE 1617
NO
CASE 1618
NO
CASE 1619
NO
CASE 1620
NO
CASE 1621
167
CASE 1622
NO
CASE 1623
NO
CASE 1624
NO
CASE 1625
NO
CASE 1626
NO
CASE 1627
NO
CASE 1628
NO
CASE 1629
NO
CASE 1630
NO
CASE 1631
47
CASE 1632
NO
CASE 1633
NO
CASE 1634
NO
CASE 1635
NO
CASE 1636
NO
CASE 1637
NO
CASE 1638
NO
CASE 1639
NO
CASE 1640
NO
CASE 1641
1
CASE 1642
NO
CASE 1643
NO
CASE 1644
NO
CASE 1645
NO
CASE 1646
NO
CASE 1647
NO
CASE 1648
NO
CASE 1649
NO
CASE 1650
NO
CASE 1651
7
CASE 1652
NO
CASE 1653
NO
CASE 1654
NO
CASE 1655
NO
CASE 1656
NO
CASE 1657
NO
CASE 1658
NO
CASE 1659
NO
CASE 1660
NO
CASE 1661
1
CASE 1662
NO
CASE 1663
NO
CASE 1664
NO
CASE 1665
NO
CASE 1666
NO
CASE 1667
NO
CASE 1668
NO
CASE 1669
NO
CASE 1670
NO
CASE 1671
1
CASE 1672
NO
CASE 1673
NO
CASE 1674
NO
CASE 1675
NO
CASE 1676
NO
CASE 1677
NO
CASE 1678
NO
CASE 1679
NO
CASE 1680
NO
CASE 1681
3
CASE 1682
NO
CASE 1683
NO
CASE 1684
NO
CASE 1685
NO
CASE 1686
NO
CASE 1687
NO
CASE 1688
NO
CASE 1689
NO
CASE 1690
NO
CASE 1691
31
CASE 1692
NO
CASE 1693
NO
CASE 1694
NO
CASE 1695
NO
CASE 1696
NO
CASE 1697
NO
CASE 1698
NO
CASE 1699
NO
CASE 1700
2460
CASE 1701
2
CASE 1702
NO
CASE 1703
NO
CASE 1704
NO
CASE 1705
NO
CASE 1706
NO
CASE 1707
NO
CASE 1708
NO
CASE 1709
NO
CASE 1710
NO
CASE 1711
3
CASE 1712
NO
CASE 1713
NO
CASE 1714
NO
CASE 1715
26
CASE 1716
NO
CASE 1717
NO
CASE 1718
NO
CASE 1719
NO
CASE 1720
NO
CASE 1721
1
CASE 1722
NO
CASE 1723
NO
CASE 1724
NO
CASE 1725
NO
CASE 1726
NO
CASE 1727
NO
CASE 1728
NO
CASE 1729
NO
CASE 1730
NO
CASE 1731
2
CASE 1732
NO
CASE 1733
NO
CASE 1734
NO
CASE 1735
NO
CASE 1736
NO
CASE 1737
NO
CASE 1738
NO
CASE 1739
NO
CASE 1740
NO
CASE 1741
1
CASE 1742
NO
CASE 1743
NO
CASE 1744
NO
CASE 1745
NO
CASE 1746
NO
CASE 1747
NO
CASE 1748
NO
CASE 1749
NO
CASE 1750
NO
CASE 1751
59
CASE 1752
NO
CASE 1753
NO
CASE 1754
NO
CASE 1755
NO
CASE 1756
NO
CASE 1757
NO
CASE 1758
NO
CASE 1759
NO
CASE 1760
NO
CASE 1761
76
CASE 1762
NO
CASE 1763
NO
CASE 1764
NO
CASE 1765
NO
CASE 1766
NO
CASE 1767
NO
CASE 1768
NO
CASE 1769
NO
CASE 1770
NO
CASE 1771
2
CASE 1772
NO
CASE 1773
NO
CASE 1774
NO
CASE 1775
NO
CASE 1776
NO
CASE 1777
NO
CASE 1778
NO
CASE 1779
NO
CASE 1780
NO
CASE 1781
4
CASE 1782
NO
CASE 1783
NO
CASE 1784
NO
CASE 1785
NO
CASE 1786
NO
CASE 1787
NO
CASE 1788
NO
CASE 1789
NO
CASE 1790
NO
CASE 1791
15
CASE 1792
NO
CASE 1793
NO
CASE 1794
NO
CASE 1795
NO
CASE 1796
NO
CASE 1797
NO
CASE 1798
NO
CASE 1799
NO
CASE 1800
NO
CASE 1801
1
CASE 1802
NO
CASE 1803
NO
CASE 1804
NO
CASE 1805
NO
CASE 1806
NO
CASE 1807
NO
CASE 1808
NO
CASE 1809
NO
CASE 1810
NO
CASE 1811
3
CASE 1812
NO
CASE 1813
NO
CASE 1814
NO
CASE 1815
NO
CASE 1816
NO
CASE 1817
NO
CASE 1818
NO
CASE 1819
NO
CASE 1820
NO
CASE 1821
2
CASE 1822
NO
CASE 1823
NO
CASE 1824
NO
CASE 1825
NO
CASE 1826
NO
CASE 1827
NO
CASE 1828
NO
CASE 1829
NO
CASE 1830
NO
CASE 1831
1
CASE 1832
NO
CASE 1833
NO
CASE 1834
NO
CASE 1835
NO
CASE 1836
NO
CASE 1837
NO
CASE 1838
NO
CASE 1839
NO
CASE 1840
NO
CASE 1841
2
CASE 1842
NO
CASE 1843
NO
CASE 1844
NO
CASE 1845
NO
CASE 1846
NO
CASE 1847
NO
CASE 1848
NO
CASE 1849
NO
CASE 1850
NO
CASE 1851
1064
CASE 1852
NO
CASE 1853
NO
CASE 1854
NO
CASE 1855
NO
CASE 1856
NO
CASE 1857
NO
CASE 1858
NO
CASE 1859
NO
CASE 1860
NO
CASE 1861
1
CASE 1862
NO
CASE 1863
NO
CASE 1864
NO
CASE 1865
NO
CASE 1866
NO
CASE 1867
NO
CASE 1868
NO
CASE 1869
NO
CASE 1870
NO
CASE 1871
1
CASE 1872
NO
CASE 1873
NO
CASE 1874
NO
CASE 1875
NO
CASE 1876
NO
CASE 1877
NO
CASE 1878
NO
CASE 1879
NO
CASE 1880
116
CASE 1881
2
CASE 1882
NO
CASE 1883
NO
CASE 1884
NO
CASE 1885
NO
CASE 1886
NO
CASE 1887
NO
CASE 1888
NO
CASE 1889
NO
CASE 1890
NO
CASE 1891
3
CASE 1892
NO
CASE 1893
NO
CASE 1894
NO
CASE 1895
NO
CASE 1896
NO
CASE 1897
NO
CASE 1898
NO
CASE 1899
NO
CASE 1900
NO
CASE 1901
169
CASE 1902
NO
CASE 1903
NO
CASE 1904
NO
CASE 1905
NO
CASE 1906
NO
CASE 1907
NO
CASE 1908
NO
CASE 1909
NO
CASE 1910
NO
CASE 1911
3
CASE 1912
2
CASE 1913
NO
CASE 1914
NO
CASE 1915
NO
CASE 1916
NO
CASE 1917
NO
CASE 1918
NO
CASE 1919
NO
CASE 1920
NO
CASE 1921
55
CASE 1922
NO
CASE 1923
NO
CASE 1924
NO
CASE 1925
NO
CASE 1926
NO
CASE 1927
NO
CASE 1928
NO
CASE 1929
NO
CASE 1930
NO
CASE 1931
1
CASE 1932
NO
CASE 1933
NO
CASE 1934
NO
CASE 1935
NO
CASE 1936
NO
CASE 1937
13
CASE 1938
NO
CASE 1939
NO
CASE 1940
NO
CASE 1941
3
CASE 1942
NO
CASE 1943
NO
CASE 1944
NO
CASE 1945
NO
CASE 1946
NO
CASE 1947
NO
CASE 1948
NO
CASE 1949
NO
CASE 1950
NO
CASE 1951
1
CASE 1952
NO
CASE 1953
NO
CASE 1954
NO
CASE 1955
NO
CASE 1956
NO
CASE 1957
NO
CASE 1958
NO
CASE 1959
NO
CASE 1960
NO
CASE 1961
4
CASE 1962
NO
CASE 1963
NO
CASE 1964
NO
CASE 1965
NO
CASE 1966
NO
CASE 1967
NO
CASE 1968
NO
CASE 1969
NO
CASE 1970
NO
CASE 1971
1
CASE 1972
NO
CASE 1973
NO
CASE 1974
NO
CASE 1975
NO
CASE 1976
NO
CASE 1977
NO
CASE 1978
NO
CASE 1979
NO
CASE 1980
NO
CASE 1981
24
CASE 1982
NO
CASE 1983
NO
CASE 1984
NO
CASE 1985
NO
CASE 1986
NO
CASE 1987
NO
CASE 1988
NO
CASE 1989
NO
CASE 1990
NO
CASE 1991
8
CASE 1992
NO
CASE 1993
NO
CASE 1994
NO
CASE 1995
NO
CASE 1996
NO
CASE 1997
NO
CASE 1998
NO
CASE 1999
NO
CASE 2000
NO
CASE 2001
71
CASE 2002
NO
CASE 2003
16
CASE 2004
NO
CASE 2005
NO
CASE 2006
NO
CASE 2007
NO
CASE 2008
NO
CASE 2009
NO
CASE 2010
NO
CASE 2011
40
CASE 2012
NO
CASE 2013
NO
CASE 2014
NO
CASE 2015
NO
CASE 2016
NO
CASE 2017
NO
CASE 2018
NO
CASE 2019
NO
CASE 2020
NO
CASE 2021
1
CASE 2022
NO
CASE 2023
NO
CASE 2024
NO
CASE 2025
NO
CASE 2026
NO
CASE 2027
NO
CASE 2028
NO
CASE 2029
NO
CASE 2030
NO
CASE 2031
27
CASE 2032
NO
CASE 2033
NO
CASE 2034
NO
CASE 2035
NO
CASE 2036
NO
CASE 2037
NO
CASE 2038
NO
CASE 2039
NO
CASE 2040
NO
CASE 2041
628
CASE 2042
NO
CASE 2043
NO
CASE 2044
NO
CASE 2045
NO
CASE 2046
NO
CASE 2047
NO
CASE 2048
NO
CASE 2049
NO
CASE 2050
NO
CASE 2051
2
CASE 2052
NO
CASE 2053
NO
CASE 2054
NO
CASE 2055
NO
CASE 2056
NO
CASE 2057
NO
CASE 2058
NO
CASE 2059
NO
CASE 2060
NO
CASE 2061
53
CASE 2062
NO
CASE 2063
NO
CASE 2064
NO
CASE 2065
NO
CASE 2066
NO
CASE 2067
NO
CASE 2068
NO
CASE 2069
NO
CASE 2070
NO
CASE 2071
1
CASE 2072
NO
CASE 2073
NO
CASE 2074
NO
CASE 2075
NO
CASE 2076
NO
CASE 2077
NO
CASE 2078
NO
CASE 2079
NO
CASE 2080
NO
CASE 2081
6
CASE 2082
NO
CASE 2083
NO
CASE 2084
NO
CASE 2085
NO
CASE 2086
NO
CASE 2087
NO
CASE 2088
NO
CASE 2089
NO
CASE 2090
NO
CASE 2091
14
CASE 2092
NO
CASE 2093
NO
CASE 2094
NO
CASE 2095
NO
CASE 2096
NO
CASE 2097
NO
CASE 2098
NO
CASE 2099
NO
CASE 2100
NO
CASE 2101
2
CASE 2102
NO
CASE 2103
NO
CASE 2104
NO
CASE 2105
NO
CASE 2106
NO
CASE 2107
NO
CASE 2108
NO
CASE 2109
NO
CASE 2110
NO
CASE 2111
1
CASE 2112
NO
CASE 2113
NO
CASE 2114
NO
CASE 2115
NO
CASE 2116
NO
CASE 2117
NO
CASE 2118
NO
CASE 2119
NO
CASE 2120
NO
CASE 2121
2
CASE 2122
NO
CASE 2123
NO
CASE 2124
NO
CASE 2125
NO
CASE 2126
NO
CASE 2127
NO
CASE 2128
NO
CASE 2129
NO
CASE 2130
NO
CASE 2131
1
CASE 2132
NO
CASE 2133
NO
CASE 2134
NO
CASE 2135
NO
CASE 2136
NO
CASE 2137
NO
CASE 2138
NO
CASE 2139
NO
CASE 2140
NO
CASE 2141
4
CASE 2142
NO
CASE 2143
NO
CASE 2144
NO
CASE 2145
NO
CASE 2146
NO
CASE 2147
NO
CASE 2148
NO
CASE 2149
NO
CASE 2150
NO
CASE 2151
4
CASE 2152
NO
CASE 2153
NO
CASE 2154
NO
CASE 2155
NO
CASE 2156
NO
CASE 2157
NO
CASE 2158
NO
CASE 2159
NO
CASE 2160
NO
CASE 2161
4
CASE 2162
NO
CASE 2163
NO
CASE 2164
NO
CASE 2165
NO
CASE 2166
NO
CASE 2167
NO
CASE 2168
NO
CASE 2169
NO
CASE 2170
NO
CASE 2171
86
CASE 2172
NO
CASE 2173
NO
CASE 2174
NO
CASE 2175
NO
CASE 2176
NO
CASE 2177
NO
CASE 2178
NO
CASE 2179
NO
CASE 2180
NO
CASE 2181
19
CASE 2182
NO
CASE 2183
NO
CASE 2184
NO
CASE 2185
NO
CASE 2186
NO
CASE 2187
NO
CASE 2188
NO
CASE 2189
NO
CASE 2190
NO
CASE 2191
2
CASE 2192
NO
CASE 2193
NO
CASE 2194
NO
CASE 2195
NO
CASE 2196
NO
CASE 2197
NO
CASE 2198
NO
CASE 2199
NO
CASE 2200
NO
CASE 2201
2
CASE 2202
NO
CASE 2203
NO
CASE 2204
NO
CASE 2205
NO
CASE 2206
NO
CASE 2207
NO
CASE 2208
NO
CASE 2209
NO
CASE 2210
NO
CASE 2211
1
CASE 2212
NO
CASE 2213
NO
CASE 2214
NO
CASE 2215
NO
CASE 2216
NO
CASE 2217
NO
CASE 2218
NO
CASE 2219
NO
CASE 2220
NO
CASE 2221
1
CASE 2222
NO
CASE 2223
NO
CASE 2224
NO
CASE 2225
NO
CASE 2226
NO
CASE 2227
NO
CASE 2228
NO
CASE 2229
NO
CASE 2230
NO
CASE 2231
24
CASE 2232
NO
CASE 2233
NO
CASE 2234
NO
CASE 2235
NO
CASE 2236
NO
CASE 2237
NO
CASE 2238
NO
CASE 2239
NO
CASE 2240
NO
CASE 2241
14
CASE 2242
NO
CASE 2243
NO
CASE 2244
NO
CASE 2245
NO
CASE 2246
NO
CASE 2247
NO
CASE 2248
NO
CASE 2249
NO
CASE 2250
NO
CASE 2251
1
CASE 2252
NO
CASE 2253
NO
CASE 2254
NO
CASE 2255
NO
CASE 2256
NO
CASE 2257
NO
CASE 2258
NO
CASE 2259
NO
CASE 2260
NO
CASE 2261
3
CASE 2262
NO
CASE 2263
NO
CASE 2264
NO
CASE 2265
NO
CASE 2266
NO
CASE 2267
NO
CASE 2268
NO
CASE 2269
NO
CASE 2270
NO
CASE 2271
7
CASE 2272
1
CASE 2273
NO
CASE 2274
NO
CASE 2275
NO
CASE 2276
NO
CASE 2277
NO
CASE 2278
NO
CASE 2279
NO
CASE 2280
NO
CASE 2281
1
CASE 2282
NO
CASE 2283
1015
CASE 2284
NO
CASE 2285
NO
CASE 2286
NO
CASE 2287
NO
CASE 2288
NO
CASE 2289
NO
CASE 2290
NO
CASE 2291
1
CASE 2292
NO
CASE 2293
NO
CASE 2294
NO
CASE 2295
NO
CASE 2296
NO
CASE 2297
NO
CASE 2298
NO
CASE 2299
NO
CASE 2300
NO
CASE 2301
1
CASE 2302
NO
CASE 2303
NO
CASE 2304
NO
CASE 2305
NO
CASE 2306
NO
CASE 2307
NO
CASE 2308
NO
CASE 2309
NO
CASE 2310
NO
CASE 2311
123
CASE 2312
NO
CASE 2313
NO
CASE 2314
NO
CASE 2315
NO
CASE 2316
NO
CASE 2317
NO
CASE 2318
NO
CASE 2319
NO
CASE 2320
NO
CASE 2321
1
CASE 2322
NO
CASE 2323
NO
CASE 2324
NO
CASE 2325
NO
CASE 2326
NO
CASE 2327
NO
CASE 2328
NO
CASE 2329
NO
CASE 2330
NO
CASE 2331
1
CASE 2332
NO
CASE 2333
NO
CASE 2334
NO
CASE 2335
NO
CASE 2336
NO
CASE 2337
NO
CASE 2338
NO
CASE 2339
NO
CASE 2340
NO
CASE 2341
1
CASE 2342
NO
CASE 2343
NO
CASE 2344
NO
CASE 2345
NO
CASE 2346
NO
CASE 2347
NO
CASE 2348
NO
CASE 2349
NO
CASE 2350
NO
CASE 2351
1
CASE 2352
NO
CASE 2353
NO
CASE 2354
NO
CASE 2355
NO
CASE 2356
NO
CASE 2357
NO
CASE 2358
NO
CASE 2359
NO
CASE 2360
NO
CASE 2361
1
CASE 2362
NO
CASE 2363
NO
CASE 2364
NO
CASE 2365
NO
CASE 2366
NO
CASE 2367
NO
CASE 2368
NO
CASE 2369
NO
CASE 2370
NO
CASE 2371
1
CASE 2372
NO
CASE 2373
NO
CASE 2374
NO
CASE 2375
NO
CASE 2376
NO
CASE 2377
NO
CASE 2378
NO
CASE 2379
NO
CASE 2380
NO
CASE 2381
1
CASE 2382
NO
CASE 2383
NO
CASE 2384
NO
CASE 2385
NO
CASE 2386
NO
CASE 2387
NO
CASE 2388
NO
CASE 2389
NO
CASE 2390
NO
CASE 2391
1
CASE 2392
NO
CASE 2393
NO
CASE 2394
NO
CASE 2395
NO
CASE 2396
NO
CASE 2397
NO
CASE 2398
NO
CASE 2399
NO
CASE 2400
NO
CASE 2401
8
CASE 2402
NO
CASE 2403
NO
CASE 2404
NO
CASE 2405
NO
CASE 2406
NO
CASE 2407
NO
CASE 2408
NO
CASE 2409
NO
CASE 2410
NO
CASE 2411
8
CASE 2412
NO
CASE 2413
NO
CASE 2414
NO
CASE 2415
NO
CASE 2416
NO
CASE 2417
NO
CASE 2418
NO
CASE 2419
NO
CASE 2420
NO
CASE 2421
399
CASE 2422
NO
CASE 2423
NO
CASE 2424
NO
CASE 2425
NO
CASE 2426
NO
CASE 2427
NO
CASE 2428
NO
CASE 2429
NO
CASE 2430
NO
CASE 2431
1
CASE 2432
NO
CASE 2433
NO
CASE 2434
NO
CASE 2435
NO
CASE 2436
NO
CASE 2437
NO
CASE 2438
NO
CASE 2439
NO
CASE 2440
NO
CASE 2441
28
CASE 2442
NO
CASE 2443
NO
CASE 2444
NO
CASE 2445
NO
CASE 2446
NO
CASE 2447
NO
CASE 2448
NO
CASE 2449
NO
CASE 2450
NO
CASE 2451
4
CASE 2452
NO
CASE 2453
295
CASE 2454
NO
CASE 2455
NO
CASE 2456
NO
CASE 2457
NO
CASE 2458
NO
CASE 2459
NO
CASE 2460
NO
CASE 2461
68
CASE 2462
NO
CASE 2463
NO
CASE 2464
NO
CASE 2465
NO
CASE 2466
NO
CASE 2467
NO
CASE 2468
NO
CASE 2469
NO
CASE 2470
NO
CASE 2471
1
CASE 2472
NO
CASE 2473
NO
CASE 2474
NO
CASE 2475
NO
CASE 2476
NO
CASE 2477
NO
CASE 2478
NO
CASE 2479
NO
CASE 2480
NO
CASE 2481
3
CASE 2482
NO
CASE 2483
NO
CASE 2484
NO
CASE 2485
NO
CASE 2486
NO
CASE 2487
NO
CASE 2488
NO
CASE 2489
NO
CASE 2490
NO
CASE 2491
2
CASE 2492
NO
CASE 2493
NO
CASE 2494
NO
CASE 2495
NO
CASE 2496
NO
CASE 2497
NO
CASE 2498
NO
CASE 2499
NO
CASE 2500
NO
CASE 2501
1
CASE 2502
NO
CASE 2503
NO
CASE 2504
NO
CASE 2505
NO
CASE 2506
NO
CASE 2507
NO
CASE 2508
NO
CASE 2509
NO
CASE 2510
NO
CASE 2511
23
CASE 2512
NO
CASE 2513
NO
CASE 2514
NO
CASE 2515
NO
CASE 2516
NO
CASE 2517
NO
CASE 2518
NO
CASE 2519
NO
CASE 2520
NO
CASE 2521
1
CASE 2522
NO
CASE 2523
NO
CASE 2524
NO
CASE 2525
NO
CASE 2526
NO
CASE 2527
NO
CASE 2528
NO
CASE 2529
NO
CASE 2530
NO
CASE 2531
9
CASE 2532
NO
CASE 2533
NO
CASE 2534
NO
CASE 2535
NO
CASE 2536
NO
CASE 2537
NO
CASE 2538
NO
CASE 2539
NO
CASE 2540
NO
CASE 2541
1
CASE 2542
NO
CASE 2543
NO
CASE 2544
NO
CASE 2545
NO
CASE 2546
NO
CASE 2547
NO
CASE 2548
NO
CASE 2549
NO
CASE 2550
NO
CASE 2551
2
CASE 2552
NO
CASE 2553
NO
CASE 2554
NO
CASE 2555
NO
CASE 2556
NO
CASE 2557
NO
CASE 2558
NO
CASE 2559
NO
CASE 2560
NO
CASE 2561
9
CASE 2562
NO
CASE 2563
NO
CASE 2564
NO
CASE 2565
NO
CASE 2566
NO
CASE 2567
NO
CASE 2568
NO
CASE 2569
NO
CASE 2570
NO
CASE 2571
1
CASE 2572
NO
CASE 2573
NO
CASE 2574
NO
CASE 2575
NO
CASE 2576
NO
CASE 2577
NO
CASE 2578
NO
CASE 2579
NO
CASE 2580
NO
CASE 2581
9
CASE 2582
NO
CASE 2583
NO
CASE 2584
NO
CASE 2585
NO
CASE 2586
NO
CASE 2587
NO
CASE 2588
NO
CASE 2589
NO
CASE 2590
NO
CASE 2591
122
CASE 2592
NO
CASE 2593
NO
CASE 2594
NO
CASE 2595
NO
CASE 2596
NO
CASE 2597
NO
CASE 2598
NO
CASE 2599
NO
CASE 2600
NO
CASE 2601
5
CASE 2602
NO
CASE 2603
NO
CASE 2604
NO
CASE 2605
NO
CASE 2606
NO
CASE 2607
NO
CASE 2608
NO
CASE 2609
NO
CASE 2610
NO
CASE 2611
113
CASE 2612
NO
CASE 2613
NO
CASE 2614
NO
CASE 2615
NO
CASE 2616
NO
CASE 2617
NO
CASE 2618
NO
CASE 2619
NO
CASE 2620
NO
CASE 2621
1
CASE 2622
NO
CASE 2623
NO
CASE 2624
NO
CASE 2625
NO
CASE 2626
NO
CASE 2627
NO
CASE 2628
NO
CASE 2629
NO
CASE 2630
NO
CASE 2631
2
CASE 2632
NO
CASE 2633
NO
CASE 2634
NO
CASE 2635
NO
CASE 2636
NO
CASE 2637
10
CASE 2638
NO
CASE 2639
NO
CASE 2640
NO
CASE 2641
1
CASE 2642
NO
CASE 2643
NO
CASE 2644
NO
CASE 2645
NO
CASE 2646
NO
CASE 2647
NO
CASE 2648
NO
CASE 2649
NO
CASE 2650
NO
CASE 2651
23
CASE 2652
NO
CASE 2653
NO
CASE 2654
NO
CASE 2655
NO
CASE 2656
NO
CASE 2657
NO
CASE 2658
NO
CASE 2659
NO
CASE 2660
NO
CASE 2661
8
CASE 2662
NO
CASE 2663
NO
CASE 2664
NO
CASE 2665
NO
CASE 2666
NO
CASE 2667
NO
CASE 2668
NO
CASE 2669
NO
CASE 2670
NO
CASE 2671
2
CASE 2672
NO
CASE 2673
NO
CASE 2674
NO
CASE 2675
NO
CASE 2676
NO
CASE 2677
NO
CASE 2678
NO
CASE 2679
3804
CASE 2680
NO
CASE 2681
35
CASE 2682
NO
CASE 2683
NO
CASE 2684
NO
CASE 2685
NO
CASE 2686
NO
CASE 2687
NO
CASE 2688
NO
CASE 2689
NO
CASE 2690
NO
CASE 2691
5
CASE 2692
NO
CASE 2693
NO
CASE 2694
NO
CASE 2695
NO
CASE 2696
NO
CASE 2697
NO
CASE 2698
NO
CASE 2699
NO
CASE 2700
NO
CASE 2701
1
CASE 2702
NO
CASE 2703
NO
CASE 2704
NO
CASE 2705
NO
CASE 2706
NO
CASE 2707
NO
CASE 2708
NO
CASE 2709
NO
CASE 2710
NO
CASE 2711
1
CASE 2712
NO
CASE 2713
NO
CASE 2714
NO
CASE 2715
NO
CASE 2716
NO
CASE 2717
NO
CASE 2718
NO
CASE 2719
NO
CASE 2720
NO
CASE 2721
1
CASE 2722
NO
CASE 2723
NO
CASE 2724
NO
CASE 2725
NO
CASE 2726
NO
CASE 2727
NO
CASE 2728
NO
CASE 2729
NO
CASE 2730
NO
CASE 2731
309
CASE 2732
NO
CASE 2733
NO
CASE 2734
NO
CASE 2735
NO
CASE 2736
1387
CASE 2737
NO
CASE 2738
NO
CASE 2739
NO
CASE 2740
NO
CASE 2741
1
CASE 2742
NO
CASE 2743
NO
CASE 2744
NO
CASE 2745
NO
CASE 2746
NO
CASE 2747
NO
CASE 2748
NO
CASE 2749
NO
CASE 2750
NO
CASE 2751
1
CASE 2752
NO
CASE 2753
NO
CASE 2754
NO
CASE 2755
NO
CASE 2756
NO
CASE 2757
NO
CASE 2758
NO
CASE 2759
NO
CASE 2760
NO
CASE 2761
25
CASE 2762
NO
CASE 2763
NO
CASE 2764
NO
CASE 2765
NO
CASE 2766
NO
CASE 2767
NO
CASE 2768
NO
CASE 2769
NO
CASE 2770
NO
CASE 2771
2
CASE 2772
NO
CASE 2773
NO
CASE 2774
NO
CASE 2775
NO
CASE 2776
NO
CASE 2777
NO
CASE 2778
NO
CASE 2779
NO
CASE 2780
NO
CASE 2781
1
CASE 2782
NO
CASE 2783
NO
CASE 2784
NO
CASE 2785
NO
CASE 2786
NO
CASE 2787
NO
CASE 2788
NO
CASE 2789
NO
CASE 2790
NO
CASE 2791
1
CASE 2792
NO
CASE 2793
NO
CASE 2794
NO
CASE 2795
NO
CASE 2796
NO
CASE 2797
NO
CASE 2798
NO
CASE 2799
NO
CASE 2800
NO
CASE 2801
2
CASE 2802
NO
CASE 2803
NO
CASE 2804
NO
CASE 2805
NO
CASE 2806
NO
CASE 2807
NO
CASE 2808
NO
CASE 2809
NO
CASE 2810
NO
CASE 2811
1
CASE 2812
NO
CASE 2813
NO
CASE 2814
NO
CASE 2815
NO
CASE 2816
NO
CASE 2817
NO
CASE 2818
NO
CASE 2819
NO
CASE 2820
NO
CASE 2821
165
CASE 2822
NO
CASE 2823
NO
CASE 2824
NO
CASE 2825
NO
CASE 2826
NO
CASE 2827
NO
CASE 2828
NO
CASE 2829
NO
CASE 2830
NO
CASE 2831
2
CASE 2832
3
CASE 2833
NO
CASE 2834
NO
CASE 2835
NO
CASE 2836
NO
CASE 2837
NO
CASE 2838
NO
CASE 2839
NO
CASE 2840
NO
CASE 2841
4
CASE 2842
NO
CASE 2843
NO
CASE 2844
NO
CASE 2845
NO
CASE 2846
NO
CASE 2847
NO
CASE 2848
NO
CASE 2849
NO
CASE 2850
NO
CASE 2851
1
CASE 2852
NO
CASE 2853
NO
CASE 2854
NO
CASE 2855
NO
CASE 2856
NO
CASE 2857
NO
CASE 2858
NO
CASE 2859
NO
CASE 2860
NO
CASE 2861
3
CASE 2862
NO
CASE 2863
NO
CASE 2864
1
CASE 2865
NO
CASE 2866
NO
CASE 2867
NO
CASE 2868
NO
CASE 2869
NO
CASE 2870
NO
CASE 2871
1
CASE 2872
NO
CASE 2873
NO
CASE 2874
NO
CASE 2875
NO
CASE 2876
NO
CASE 2877
NO
CASE 2878
NO
CASE 2879
NO
CASE 2880
NO
CASE 2881
7
CASE 2882
NO
CASE 2883
NO
CASE 2884
NO
CASE 2885
NO
CASE 2886
NO
CASE 2887
NO
CASE 2888
NO
CASE 2889
NO
CASE 2890
NO
CASE 2891
1
CASE 2892
NO
CASE 2893
NO
CASE 2894
NO
CASE 2895
NO
CASE 2896
1
CASE 2897
NO
CASE 2898
NO
CASE 2899
NO
CASE 2900
NO
CASE 2901
1
CASE 2902
NO
CASE 2903
NO
CASE 2904
NO
CASE 2905
NO
CASE 2906
NO
CASE 2907
NO
CASE 2908
NO
CASE 2909
NO
CASE 2910
NO
CASE 2911
3
CASE 2912
NO
CASE 2913
NO
CASE 2914
NO
CASE 2915
NO
CASE 2916
NO
CASE 2917
NO
CASE 2918
NO
CASE 2919
NO
CASE 2920
NO
CASE 2921
5
CASE 2922
NO
CASE 2923
NO
CASE 2924
NO
CASE 2925
NO
CASE 2926
NO
CASE 2927
NO
CASE 2928
NO
CASE 2929
NO
CASE 2930
NO
CASE 2931
1
CASE 2932
NO
CASE 2933
NO
CASE 2934
NO
CASE 2935
NO
CASE 2936
NO
CASE 2937
NO
CASE 2938
NO
CASE 2939
NO
CASE 2940
NO
CASE 2941
1
CASE 2942
NO
CASE 2943
NO
CASE 2944
NO
CASE 2945
NO
CASE 2946
NO
CASE 2947
NO
CASE 2948
NO
CASE 2949
NO
CASE 2950
NO
CASE 2951
5
CASE 2952
NO
CASE 2953
NO
CASE 2954
NO
CASE 2955
NO
CASE 2956
NO
CASE 2957
NO
CASE 2958
NO
CASE 2959
NO
CASE 2960
NO
CASE 2961
1
CASE 2962
NO
CASE 2963
NO
CASE 2964
NO
CASE 2965
NO
CASE 2966
NO
CASE 2967
NO
CASE 2968
NO
CASE 2969
NO
CASE 2970
NO
CASE 2971
3
CASE 2972
NO
CASE 2973
88
CASE 2974
NO
CASE 2975
NO
CASE 2976
NO
CASE 2977
NO
CASE 2978
NO
CASE 2979
NO
CASE 2980
NO
CASE 2981
3
CASE 2982
NO
CASE 2983
NO
CASE 2984
NO
CASE 2985
NO
CASE 2986
NO
CASE 2987
NO
CASE 2988
NO
CASE 2989
NO
CASE 2990
NO
CASE 2991
4
CASE 2992
NO
CASE 2993
NO
CASE 2994
NO
CASE 2995
NO
CASE 2996
NO
CASE 2997
NO
CASE 2998
NO
CASE 2999
NO
CASE 3000
NO
CASE 3001
11
CASE 3002
NO
CASE 3003
NO
CASE 3004
NO
CASE 3005
NO
CASE 3006
NO
CASE 3007
NO
CASE 3008
NO
CASE 3009
NO
CASE 3010
NO
CASE 3011
14
CASE 3012
NO
CASE 3013
NO
CASE 3014
NO
CASE 3015
NO
CASE 3016
NO
CASE 3017
NO
CASE 3018
NO
CASE 3019
NO
CASE 3020
NO
CASE 3021
2
CASE 3022
NO
CASE 3023
NO
CASE 3024
NO
CASE 3025
NO
CASE 3026
NO
CASE 3027
NO
CASE 3028
NO
CASE 3029
NO
CASE 3030
NO
CASE 3031
12
CASE 3032
NO
CASE 3033
NO
CASE 3034
NO
CASE 3035
NO
CASE 3036
NO
CASE 3037
NO
CASE 3038
NO
CASE 3039
NO
CASE 3040
NO
CASE 3041
4
CASE 3042
NO
CASE 3043
NO
CASE 3044
NO
CASE 3045
NO
CASE 3046
NO
CASE 3047
NO
CASE 3048
NO
CASE 3049
NO
CASE 3050
NO
CASE 3051
6
CASE 3052
NO
CASE 3053
NO
CASE 3054
NO
CASE 3055
NO
CASE 3056
NO
CASE 3057
NO
CASE 3058
NO
CASE 3059
NO
CASE 3060
NO
CASE 3061
1
CASE 3062
NO
CASE 3063
NO
CASE 3064
NO
CASE 3065
NO
CASE 3066
NO
CASE 3067
NO
CASE 3068
NO
CASE 3069
NO
CASE 3070
NO
CASE 3071
3
CASE 3072
NO
CASE 3073
NO
CASE 3074
NO
CASE 3075
NO
CASE 3076
NO
CASE 3077
NO
CASE 3078
NO
CASE 3079
NO
CASE 3080
NO
CASE 3081
2
CASE 3082
9
CASE 3083
NO
CASE 3084
NO
CASE 3085
NO
CASE 3086
NO
CASE 3087
NO
CASE 3088
NO
CASE 3089
NO
CASE 3090
NO
CASE 3091
24
CASE 3092
NO
CASE 3093
NO
CASE 3094
NO
CASE 3095
NO
CASE 3096
NO
CASE 3097
NO
CASE 3098
NO
CASE 3099
NO
CASE 3100
NO
CASE 3101
11
CASE 3102
NO
CASE 3103
NO
CASE 3104
NO
CASE 3105
NO
CASE 3106
NO
CASE 3107
NO
CASE 3108
NO
CASE 3109
NO
CASE 3110
NO
CASE 3111
16
CASE 3112
NO
CASE 3113
NO
CASE 3114
NO
CASE 3115
NO
CASE 3116
NO
CASE 3117
NO
CASE 3118
NO
CASE 3119
NO
CASE 3120
NO
CASE 3121
1
CASE 3122
NO
CASE 3123
NO
CASE 3124
NO
CASE 3125
NO
CASE 3126
NO
CASE 3127
NO
CASE 3128
NO
CASE 3129
NO
CASE 3130
NO
CASE 3131
1
CASE 3132
NO
CASE 3133
NO
CASE 3134
NO
CASE 3135
NO
CASE 3136
NO
CASE 3137
NO
CASE 3138
NO
CASE 3139
NO
CASE 3140
NO
CASE 3141
30
CASE 3142
NO
CASE 3143
12
CASE 3144
NO
CASE 3145
NO
CASE 3146
NO
CASE 3147
NO
CASE 3148
NO
CASE 3149
NO
CASE 3150
NO
CASE 3151
155
CASE 3152
NO
CASE 3153
NO
CASE 3154
NO
CASE 3155
NO
CASE 3156
NO
CASE 3157
NO
CASE 3158
NO
CASE 3159
NO
CASE 3160
NO
CASE 3161
4
CASE 3162
NO
CASE 3163
7
CASE 3164
NO
CASE 3165
NO
CASE 3166
NO
CASE 3167
NO
CASE 3168
NO
CASE 3169
NO
CASE 3170
NO
CASE 3171
3
CASE 3172
NO
CASE 3173
NO
CASE 3174
NO
CASE 3175
NO
CASE 3176
NO
CASE 3177
NO
CASE 3178
NO
CASE 3179
NO
CASE 3180
NO
CASE 3181
1
CASE 3182
NO
CASE 3183
NO
CASE 3184
NO
CASE 3185
NO
CASE 3186
NO
CASE 3187
NO
CASE 3188
1408
CASE 3189
NO
CASE 3190
NO
CASE 3191
1
CASE 3192
NO
CASE 3193
NO
CASE 3194
NO
CASE 3195
NO
CASE 3196
NO
CASE 3197
NO
CASE 3198
NO
CASE 3199
NO
CASE 3200
NO
CASE 3201
1
CASE 3202
NO
CASE 3203
NO
CASE 3204
NO
CASE 3205
NO
CASE 3206
NO
CASE 3207
NO
CASE 3208
NO
CASE 3209
NO
CASE 3210
NO
CASE 3211
3
CASE 3212
NO
CASE 3213
NO
CASE 3214
NO
CASE 3215
NO
CASE 3216
NO
CASE 3217
NO
CASE 3218
NO
CASE 3219
NO
CASE 3220
NO
CASE 3221
1
CASE 3222
NO
CASE 3223
NO
CASE 3224
NO
CASE 3225
NO
CASE 3226
NO
CASE 3227
NO
CASE 3228
NO
CASE 3229
NO
CASE 3230
NO
CASE 3231
1
CASE 3232
NO
CASE 3233
NO
CASE 3234
NO
CASE 3235
NO
CASE 3236
NO
CASE 3237
NO
CASE 3238
NO
CASE 3239
NO
CASE 3240
NO
CASE 3241
1
CASE 3242
NO
CASE 3243
NO
CASE 3244
NO
CASE 3245
NO
CASE 3246
31
CASE 3247
NO
CASE 3248
NO
CASE 3249
NO
CASE 3250
NO
CASE 3251
4
CASE 3252
NO
CASE 3253
NO
CASE 3254
NO
CASE 3255
NO
CASE 3256
NO
CASE 3257
NO
CASE 3258
NO
CASE 3259
NO
CASE 3260
NO
CASE 3261
34
CASE 3262
NO
CASE 3263
NO
CASE 3264
NO
CASE 3265
NO
CASE 3266
NO
CASE 3267
4268
CASE 3268
NO
CASE 3269
NO
CASE 3270
NO
CASE 3271
1
CASE 3272
NO
CASE 3273
NO
CASE 3274
NO
CASE 3275
NO
CASE 3276
NO
CASE 3277
NO
CASE 3278
NO
CASE 3279
1
CASE 3280
NO
CASE 3281
1
CASE 3282
NO
CASE 3283
NO
CASE 3284
NO
CASE 3285
NO
CASE 3286
NO
CASE 3287
NO
CASE 3288
NO
CASE 3289
NO
CASE 3290
NO
CASE 3291
7
CASE 3292
NO
CASE 3293
NO
CASE 3294
NO
CASE 3295
NO
CASE 3296
NO
CASE 3297
NO
CASE 3298
NO
CASE 3299
NO
CASE 3300
NO
CASE 3301
4
CASE 3302
NO
CASE 3303
NO
CASE 3304
NO
CASE 3305
NO
CASE 3306
NO
CASE 3307
NO
CASE 3308
NO
CASE 3309
NO
CASE 3310
NO
CASE 3311
2
CASE 3312
NO
CASE 3313
NO
CASE 3314
NO
CASE 3315
NO
CASE 3316
NO
CASE 3317
NO
CASE 3318
NO
CASE 3319
NO
CASE 3320
NO
CASE 3321
16
CASE 3322
NO
CASE 3323
NO
CASE 3324
NO
CASE 3325
NO
CASE 3326
NO
CASE 3327
102
CASE 3328
NO
CASE 3329
NO
CASE 3330
NO
CASE 3331
1
CASE 3332
NO
CASE 3333
NO
CASE 3334
NO
CASE 3335
NO
CASE 3336
NO
CASE 3337
NO
CASE 3338
NO
CASE 3339
3
CASE 3340
NO
CASE 3341
804
CASE 3342
NO
CASE 3343
NO
CASE 3344
NO
CASE 3345
NO
CASE 3346
NO
CASE 3347
NO
CASE 3348
NO
CASE 3349
NO
CASE 3350
NO
CASE 3351
2
CASE 3352
NO
CASE 3353
NO
CASE 3354
NO
CASE 3355
NO
CASE 3356
NO
CASE 3357
NO
CASE 3358
NO
CASE 3359
NO
CASE 3360
NO
CASE 3361
1
CASE 3362
NO
CASE 3363
NO
CASE 3364
NO
CASE 3365
NO
CASE 3366
NO
CASE 3367
NO
CASE 3368
NO
CASE 3369
NO
CASE 3370
NO
CASE 3371
2
CASE 3372
NO
CASE 3373
NO
CASE 3374
NO
CASE 3375
NO
CASE 3376
NO
CASE 3377
NO
CASE 3378
NO
CASE 3379
NO
CASE 3380
NO
CASE 3381
4
CASE 3382
4
CASE 3383
NO
CASE 3384
NO
CASE 3385
NO
CASE 3386
NO
CASE 3387
NO
CASE 3388
NO
CASE 3389
NO
CASE 3390
NO
CASE 3391
1
CASE 3392
NO
CASE 3393
NO
CASE 3394
NO
CASE 3395
NO
CASE 3396
NO
CASE 3397
NO
CASE 3398
NO
CASE 3399
NO
CASE 3400
NO
CASE 3401
2
CASE 3402
NO
CASE 3403
NO
CASE 3404
NO
CASE 3405
NO
CASE 3406
NO
CASE 3407
NO
CASE 3408
NO
CASE 3409
NO
CASE 3410
NO
CASE 3411
9
CASE 3412
NO
CASE 3413
NO
CASE 3414
NO
CASE 3415
NO
CASE 3416
NO
CASE 3417
NO
CASE 3418
NO
CASE 3419
NO
CASE 3420
NO
CASE 3421
1
CASE 3422
NO
CASE 3423
NO
CASE 3424
NO
CASE 3425
NO
CASE 3426
NO
CASE 3427
NO
CASE 3428
NO
CASE 3429
NO
CASE 3430
NO
CASE 3431
1
CASE 3432
NO
CASE 3433
NO
CASE 3434
NO
CASE 3435
NO
CASE 3436
NO
CASE 3437
NO
CASE 3438
NO
CASE 3439
NO
CASE 3440
NO
CASE 3441
4
CASE 3442
5
CASE 3443
NO
CASE 3444
NO
CASE 3445
NO
CASE 3446
NO
CASE 3447
NO
CASE 3448
NO
CASE 3449
NO
CASE 3450
NO
CASE 3451
31
CASE 3452
NO
CASE 3453
NO
CASE 3454
NO
CASE 3455
NO
CASE 3456
NO
CASE 3457
NO
CASE 3458
NO
CASE 3459
NO
CASE 3460
NO
CASE 3461
1
CASE 3462
NO
CASE 3463
NO
CASE 3464
NO
CASE 3465
NO
CASE 3466
NO
CASE 3467
NO
CASE 3468
NO
CASE 3469
NO
CASE 3470
NO
CASE 3471
2
CASE 3472
NO
CASE 3473
NO
CASE 3474
NO
CASE 3475
NO
CASE 3476
NO
CASE 3477
NO
CASE 3478
NO
CASE 3479
NO
CASE 3480
NO
CASE 3481
1
CASE 3482
119
CASE 3483
NO
CASE 3484
NO
CASE 3485
NO
CASE 3486
NO
CASE 3487
NO
CASE 3488
NO
CASE 3489
NO
CASE 3490
NO
CASE 3491
5
CASE 3492
NO
CASE 3493
NO
CASE 3494
NO
CASE 3495
NO
CASE 3496
NO
CASE 3497
NO
CASE 3498
NO
CASE 3499
NO
CASE 3500
NO
CASE 3501
1
CASE 3502
NO
CASE 3503
NO
CASE 3504
NO
CASE 3505
NO
CASE 3506
NO
CASE 3507
NO
CASE 3508
NO
CASE 3509
NO
CASE 3510
NO
CASE 3511
4
CASE 3512
NO
CASE 3513
NO
CASE 3514
NO
CASE 3515
NO
CASE 3516
NO
CASE 3517
NO
CASE 3518
NO
CASE 3519
NO
CASE 3520
NO
CASE 3521
1
CASE 3522
NO
CASE 3523
NO
CASE 3524
NO
CASE 3525
NO
CASE 3526
NO
CASE 3527
NO
CASE 3528
NO
CASE 3529
NO
CASE 3530
NO
CASE 3531
62
CASE 3532
NO
CASE 3533
NO
CASE 3534
NO
CASE 3535
NO
CASE 3536
NO
CASE 3537
NO
CASE 3538
NO
CASE 3539
NO
CASE 3540
NO
CASE 3541
2
CASE 3542
NO
CASE 3543
NO
CASE 3544
NO
CASE 3545
NO
CASE 3546
NO
CASE 3547
NO
CASE 3548
NO
CASE 3549
NO
CASE 3550
NO
CASE 3551
1
CASE 3552
NO
CASE 3553
NO
CASE 3554
NO
CASE 3555
NO
CASE 3556
NO
CASE 3557
NO
CASE 3558
NO
CASE 3559
NO
CASE 3560
NO
CASE 3561
5
CASE 3562
NO
CASE 3563
NO
CASE 3564
NO
CASE 3565
NO
CASE 3566
NO
CASE 3567
NO
CASE 3568
NO
CASE 3569
NO
CASE 3570
NO
CASE 3571
4
CASE 3572
NO
CASE 3573
NO
CASE 3574
NO
CASE 3575
NO
CASE 3576
NO
CASE 3577
3481
CASE 3578
NO
CASE 3579
NO
CASE 3580
NO
CASE 3581
19
CASE 3582
NO
CASE 3583
NO
CASE 3584
NO
CASE 3585
NO
CASE 3586
NO
CASE 3587
NO
CASE 3588
NO
CASE 3589
NO
CASE 3590
NO
CASE 3591
2
CASE 3592
NO
CASE 3593
NO
CASE 3594
NO
CASE 3595
NO
CASE 3596
NO
CASE 3597
NO
CASE 3598
NO
CASE 3599
NO
CASE 3600
NO
CASE 3601
1
CASE 3602
NO
CASE 3603
NO
CASE 3604
NO
CASE 3605
NO
CASE 3606
NO
CASE 3607
NO
CASE 3608
NO
CASE 3609
NO
CASE 3610
NO
CASE 3611
6
CASE 3612
NO
CASE 3613
NO
CASE 3614
NO
CASE 3615
NO
CASE 3616
NO
CASE 3617
NO
CASE 3618
NO
CASE 3619
NO
CASE 3620
NO
CASE 3621
3
CASE 3622
NO
CASE 3623
NO
CASE 3624
NO
CASE 3625
NO
CASE 3626
NO
CASE 3627
NO
CASE 3628
NO
CASE 3629
NO
CASE 3630
NO
CASE 3631
52
CASE 3632
NO
CASE 3633
NO
CASE 3634
NO
CASE 3635
NO
CASE 3636
NO
CASE 3637
NO
CASE 3638
2
CASE 3639
NO
CASE 3640
NO
CASE 3641
12
CASE 3642
NO
CASE 3643
NO
CASE 3644
NO
CASE 3645
NO
CASE 3646
1
CASE 3647
NO
CASE 3648
NO
CASE 3649
NO
CASE 3650
NO
CASE 3651
1
CASE 3652
NO
CASE 3653
NO
CASE 3654
NO
CASE 3655
NO
CASE 3656
NO
CASE 3657
NO
CASE 3658
NO
CASE 3659
NO
CASE 3660
NO
CASE 3661
4
CASE 3662
NO
CASE 3663
NO
CASE 3664
NO
CASE 3665
NO
CASE 3666
NO
CASE 3667
NO
CASE 3668
NO
CASE 3669
NO
CASE 3670
NO
CASE 3671
17
CASE 3672
NO
CASE 3673
NO
CASE 3674
NO
CASE 3675
NO
CASE 3676
NO
CASE 3677
NO
CASE 3678
NO
CASE 3679
NO
CASE 3680
NO
CASE 3681
43
CASE 3682
NO
CASE 3683
NO
CASE 3684
NO
CASE 3685
NO
CASE 3686
NO
CASE 3687
NO
CASE 3688
NO
CASE 3689
NO
CASE 3690
NO
CASE 3691
4
CASE 3692
NO
CASE 3693
NO
CASE 3694
NO
CASE 3695
NO
CASE 3696
NO
CASE 3697
NO
CASE 3698
NO
CASE 3699
NO
CASE 3700
NO
CASE 3701
1
CASE 3702
NO
CASE 3703
NO
CASE 3704
NO
CASE 3705
NO
CASE 3706
NO
CASE 3707
NO
CASE 3708
NO
CASE 3709
NO
CASE 3710
NO
CASE 3711
10
CASE 3712
NO
CASE 3713
NO
CASE 3714
NO
CASE 3715
3
CASE 3716
NO
CASE 3717
NO
CASE 3718
NO
CASE 3719
NO
CASE 3720
NO
CASE 3721
3
CASE 3722
NO
CASE 3723
NO
CASE 3724
NO
CASE 3725
NO
CASE 3726
NO
CASE 3727
NO
CASE 3728
NO
CASE 3729
NO
CASE 3730
NO
CASE 3731
3
CASE 3732
NO
CASE 3733
NO
CASE 3734
NO
CASE 3735
NO
CASE 3736
NO
CASE 3737
NO
CASE 3738
NO
CASE 3739
NO
CASE 3740
NO
CASE 3741
2
CASE 3742
NO
CASE 3743
NO
CASE 3744
NO
CASE 3745
NO
CASE 3746
NO
CASE 3747
NO
CASE 3748
NO
CASE 3749
NO
CASE 3750
NO
CASE 3751
38
CASE 3752
NO
CASE 3753
NO
CASE 3754
NO
CASE 3755
NO
CASE 3756
NO
CASE 3757
NO
CASE 3758
NO
CASE 3759
NO
CASE 3760
NO
CASE 3761
1
CASE 3762
NO
CASE 3763
NO
CASE 3764
NO
CASE 3765
NO
CASE 3766
NO
CASE 3767
NO
CASE 3768
NO
CASE 3769
NO
CASE 3770
NO
CASE 3771
54
CASE 3772
NO
CASE 3773
NO
CASE 3774
NO
CASE 3775
14963
CASE 3776
NO
CASE 3777
NO
CASE 3778
NO
CASE 3779
NO
CASE 3780
NO
CASE 3781
5
CASE 3782
NO
CASE 3783
NO
CASE 3784
NO
CASE 3785
NO
CASE 3786
NO
CASE 3787
NO
CASE 3788
NO
CASE 3789
NO
CASE 3790
NO
CASE 3791
1
CASE 3792
NO
CASE 3793
NO
CASE 3794
NO
CASE 3795
NO
CASE 3796
NO
CASE 3797
NO
CASE 3798
NO
CASE 3799
NO
CASE 3800
NO
CASE 3801
1
CASE 3802
NO
CASE 3803
NO
CASE 3804
NO
CASE 3805
NO
CASE 3806
NO
CASE 3807
NO
CASE 3808
NO
CASE 3809
NO
CASE 3810
NO
CASE 3811
1
CASE 3812
NO
CASE 3813
NO
CASE 3814
NO
CASE 3815
NO
CASE 3816
NO
CASE 3817
NO
CASE 3818
NO
CASE 3819
NO
CASE 3820
NO
CASE 3821
7
CASE 3822
NO
CASE 3823
NO
CASE 3824
NO
CASE 3825
NO
CASE 3826
NO
CASE 3827
NO
CASE 3828
NO
CASE 3829
NO
CASE 3830
NO
CASE 3831
49
CASE 3832
NO
CASE 3833
NO
CASE 3834
NO
CASE 3835
NO
CASE 3836
NO
CASE 3837
NO
CASE 3838
NO
CASE 3839
NO
CASE 3840
NO
CASE 3841
1
CASE 3842
NO
CASE 3843
NO
CASE 3844
NO
CASE 3845
NO
CASE 3846
NO
CASE 3847
NO
CASE 3848
NO
CASE 3849
NO
CASE 3850
NO
CASE 3851
1
CASE 3852
NO
CASE 3853
NO
CASE 3854
NO
CASE 3855
NO
CASE 3856
NO
CASE 3857
NO
CASE 3858
NO
CASE 3859
NO
CASE 3860
10
CASE 3861
3
CASE 3862
NO
CASE 3863
NO
CASE 3864
NO
CASE 3865
NO
CASE 3866
NO
CASE 3867
NO
CASE 3868
NO
CASE 3869
NO
CASE 3870
NO
CASE 3871
18
CASE 3872
NO
CASE 3873
NO
CASE 3874
NO
CASE 3875
NO
CASE 3876
NO
CASE 3877
NO
CASE 3878
NO
CASE 3879
NO
CASE 3880
NO
CASE 3881
6
CASE 3882
NO
CASE 3883
NO
CASE 3884
NO
CASE 3885
NO
CASE 3886
NO
CASE 3887
NO
CASE 3888
NO
CASE 3889
NO
CASE 3890
NO
CASE 3891
92
CASE 3892
NO
CASE 3893
NO
CASE 3894
NO
CASE 3895
NO
CASE 3896
NO
CASE 3897
NO
CASE 3898
NO
CASE 3899
NO
CASE 3900
NO
CASE 3901
1
CASE 3902
NO
CASE 3903
NO
CASE 3904
NO
CASE 3905
NO
CASE 3906
NO
CASE 3907
NO
CASE 3908
NO
CASE 3909
NO
CASE 3910
NO
CASE 3911
161
CASE 3912
NO
CASE 3913
NO
CASE 3914
NO
CASE 3915
NO
CASE 3916
NO
CASE 3917
NO
CASE 3918
NO
CASE 3919
NO
CASE 3920
NO
CASE 3921
2
CASE 3922
NO
CASE 3923
NO
CASE 3924
NO
CASE 3925
NO
CASE 3926
NO
CASE 3927
NO
CASE 3928
NO
CASE 3929
NO
CASE 3930
NO
CASE 3931
3
CASE 3932
NO
CASE 3933
NO
CASE 3934
NO
CASE 3935
NO
CASE 3936
NO
CASE 3937
NO
CASE 3938
NO
CASE 3939
NO
CASE 3940
NO
CASE 3941
1
CASE 3942
NO
CASE 3943
NO
CASE 3944
NO
CASE 3945
1
CASE 3946
NO
CASE 3947
NO
CASE 3948
NO
CASE 3949
NO
CASE 3950
NO
CASE 3951
5
CASE 3952
NO
CASE 3953
NO
CASE 3954
NO
